[GameFishDB]
DBPort=1433
DBAddr=000D003C10A0D90D466A8FCC47D48E6E2E7AE7DF3D42F4E00E0CC7A039C7F07D6537AC9310A0D91A466A8FCF47D48E702E7AE7DF3D42666A0E0C717F39C703CF
DBUser=0002007143D38A2664D138E76E89048D4B9C2E3F77E113FF700625621BBD3A8A
DBPass=0008007B2C26E5DA283CE1C7288DE16E707DB98131E4F8115C899573482881D8
DBName=000A005B6277ABB328F2E1340179C8880381CA7627B1EE4A439C8A7A1525DCD56530ACE06277ABA128F210CB01791E19038110C627B10782439C349E15254B3A

[AndroidLimit]
MinTake=110000
MaxTake=8000000
MaxLeave=19900000
MinLeave=50000
;分配机器人时间(秒)
TimeDistribute=28
;分配机器人的比例
AttendPercent=800

[FreshRegulation]
FreshPlayer=1 ;	是否刷新个人输赢因子			
minElapse=3 ;最少刷新间隔(秒)
maxElapse=110;最大刷新间隔(秒)

;因子递减千分比，当此值大于0，表示是使用递增递减的方式变化个人难度，否则使用下面随机的方式
ecreasePermillage=400

;难度比例(千分比)
Percent0=0;	难度2
Percent1=100;	难度1
Percent2=300;	难度0
Percent3=100;	难度-1
Percent4=400;	难度-2
Percent5=100;	难度-3
Percent6=0;	难度-4

;
Bigfishdecreasemul=3.1;降低大鱼难度系数

UserWinMax=20000000;//最多赢钱
[LockPercent]
lock=800;	//锁定概率
lostlock=1000;	//锁定之后放弃锁定的概率
[Stock]
DynamicAddStock = -60000000
LimitStock=0;系统最低库存

;库存衰减千分比，库存达到8000000开始衰减
stockDeduct=1 

;吸水，表示小于此库存，下面的条件开始生效。可以配置成任意值（整数，负数，0）
WinScore=0 

;动态调整大鱼难度，小于0，表示更难，等于0表示不变化，大于0，表示更容易
increaseFactor=-0.1

;动态调整小鱼难度，小于0，表示更难，等于0表示不变化，大于0，表示更容易
increaseFactorSmall=-0.1

;库存值大于此值，系统开始放水
AwardScore=10000000

;送出AwardScore的千分比
awardPercent=300

;动态调整大鱼难度，小于0，表示更难，等于0表示不变化，大于0，表示更容易
awardFactor=0.2

;动态调整小鱼难度，小于0，表示更难，等于0表示不变化，大于0，表示更容易
awardFactorSmall=0.2
;玩家历史输赢是否影响其难度，1表示影响，0表示不影响
useHistory=1
